app/views/meal_ingredients/_form.html.erb

SELECT "ingredients".* FROM "ingredients" ORDER BY name ASC
---
            <div class="dropdown">
              <%= collection_select(:meal_ingredient, :ingredient_id, Ingredient.order('name ASC'), :id, :name, prompt: true, :include_blank => true) %>