app/views/meal_plans/_calendar_meal_plan_banner.html.erb

SELECT "days".* FROM "days" WHERE "days"."meal_plan_id" = $1 ORDER BY date DESC LIMIT $2  [["meal_plan_id", 23], ["LIMIT", 1]]
SELECT COUNT(*) FROM "days" WHERE "days"."meal_plan_id" = $1  [["meal_plan_id", 22]]
---

    <% if meal_plan.days.count == 1  %> <%# meal plan is only 1 day %>

SELECT "days".* FROM "days" WHERE "days"."meal_plan_id" = $1 ORDER BY date ASC LIMIT $2  [["meal_plan_id", 23], ["LIMIT", 1]]
---
                <% end %>
    <% elsif day == meal_plan.days.first %> <%# last day of meal plan %>

SELECT "days".* FROM "days" WHERE "days"."meal_plan_id" = $1 ORDER BY date DESC LIMIT $2  [["meal_plan_id", 23], ["LIMIT", 1]]
---

    <% elsif day == meal_plan.days.last %> <%# last day of meal plan %>