app/views/days/_day.html.erb

                <%= turbo_frame_tag "meallist#{day.id}" do %>
                    <% day.meals.order(:time).each do |meal| %>
---
SELECT "meals".* FROM "meals" WHERE "meals"."day_id" = $1 ORDER BY "meals"."time" ASC  [["day_id", 224]]