app/views/meals/_meal.html.erb

                                    <%= turbo_frame_tag "orphan_ingredients_list#{meal.id}" do %>
                                            <% meal.meal_ingredients.no_recipe.each do |meal_ingredient| %>
---
SELECT "ingredients".* FROM "ingredients" ORDER BY name ASC
SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."meal_id" = $1  [["meal_id", 732]]


                        <% if MealWithLeftover.meal(meal).present? %>
---
SELECT "meal_with_leftovers".* FROM "meal_with_leftovers" WHERE "meal_with_leftovers"."meal_id" = $1  [["meal_id", 727]]

                        <%= turbo_frame_tag "added_leftovers_list#{meal.id}" do %>
                                <% MealWithLeftover.meal(meal).includes(:leftover => :recipe).each do |meal_with_leftover| %>
---
SELECT "meal_with_leftovers".* FROM "meal_with_leftovers" WHERE "meal_with_leftovers"."meal_id" = $1  [["meal_id", 737]]

                                <%= turbo_frame_tag "available_leftover_list#{meal.id}" do %>
                                    <% Leftover.user(current_user).made_before(meal.time).includes(:recipe).each do |leftover| %>
---
SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."meal_id" = $1  [["meal_id", 737]]
SELECT "leftovers".* FROM "leftovers" WHERE "leftovers"."user_id" = $1 AND (date_made < '2021-10-19 05:05:00')  [["user_id", 1]]