app/views/meals/_meal.html.erb

SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."meal_id" = $1  [["meal_id", 737]]
---

                <% meal.meal_recipes.includes(:recipe).each do |meal_recipe| %>

SELECT "leftovers".* FROM "leftovers" WHERE "leftovers"."user_id" = $1 AND (date_made < '2021-10-27 08:00:00')  [["user_id", 1]]
---
            <%= turbo_frame_tag "available_leftover_list#{meal.id}" do %>
                <% Leftover.user(current_user).made_before(meal.time).includes(:recipe).each do |leftover| %>