app/views/meals/_meal_recipe_list.html.erb

SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."meal_id" = $1  [["meal_id", 742]]
---

        <% meal.meal_recipes.includes(:recipe).each do |meal_recipe| %>