app/views/meal_recipes/_meal_recipe_portion_info.html.erb

            <%= link_to "save: #{round_nicely(leftover.max_portions)}", edit_meal_recipe_leftover_path(meal_recipe, leftover), class:"badge bg-secondary text-light" %>
            <% if leftover.meal_with_leftovers.present? %>
                <%= link_to "X", meal_recipe_leftover_path(meal_recipe, leftover), method: :delete, class:"badge bg-secondary text-light",
                        data: { confirm: "Are you sure? #{leftover.meal_recipe.recipe.name} has already been added to #{ pluralize(leftover.meal_with_leftovers.count, 'meal') } " } %>
---
SELECT "leftovers".* FROM "leftovers" WHERE "leftovers"."meal_recipe_id" = $1 ORDER BY "leftovers"."id" ASC LIMIT $2  [["meal_recipe_id", 124], ["LIMIT", 1]]
SELECT "recipes".* FROM "recipes" WHERE "recipes"."id" = $1 ORDER BY "recipes"."name" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]