app/views/meal_recipes/_meal_recipe.html.erb

SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN ($1, $2, $3, $4, $5, $6)  [["id", 138], ["id", 97], ["id", 101], ["id", 111], ["id", 132], ["id", 62]]
---
                <small class="text-muted">
                        <% meal_recipe.meal_ingredients.includes(:ingredient).each do |meal_ingredient| %>