app/views/meal_recipes/_simple_form.html.erb


        <%= collection_select(:meal_recipe, :recipe_id, Recipe.all, :id, :name,
            {:prompt => 'Add recipe to meal'},
            {:class=>'input',
            :style=>'width:100%',
            :onchange=>"$('#accordion').accordion('activate',2);$('#blind').show('blind', 500)"})%>
---
SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."meal_id" = $1  [["meal_id", 743]]
SELECT "recipes".* FROM "recipes" ORDER BY "recipes"."name" ASC