app/controllers/days_controller.rb

SELECT "meal_plans".* FROM "meal_plans" WHERE "meal_plans"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def new

    @meal_plan = MealPlan.find(params[:meal_plan_id])

SELECT "days".* FROM "days" WHERE "days"."id" = $1 ORDER BY date ASC LIMIT $2  [["id", 226], ["LIMIT", 1]]
---
    def set_day
      @day = Day.find(params[:id])