app/controllers/meal_with_leftovers_controller.rb

SELECT "leftovers".* FROM "leftovers" WHERE "leftovers"."id" = $1 LIMIT $2  [["id", 103], ["LIMIT", 1]]
---
  def show
    @leftover = Leftover.find(params[:leftover_id])

SELECT "meal_with_leftovers".* FROM "meal_with_leftovers" WHERE "meal_with_leftovers"."id" = $1 LIMIT $2  [["id", 176], ["LIMIT", 1]]
---
    def set_meal_with_leftover
      @meal_with_leftover = MealWithLeftover.find(params[:id])