app/controllers/meal_plans_controller.rb

SELECT "days".* FROM "days" WHERE "days"."meal_plan_id" = $1 ORDER BY date ASC, "days"."date" ASC LIMIT $2  [["meal_plan_id", 24], ["LIMIT", 1]]
SELECT "meal_plans".* FROM "meal_plans" WHERE "meal_plans"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
  def show

    @new_meal = Meal.new
    @days = @meal_plan.days.order("date ASC")
    @meals = @meal_plan.meals
    @meal_plan = MealPlan.find(params[:id])

SELECT "meal_plans".* FROM "meal_plans" WHERE "meal_plans"."id" = $1 LIMIT $2  [["id", 24], ["LIMIT", 1]]
---
    def set_meal_plan
      @meal_plan = MealPlan.find(params[:id])