app/controllers/meal_recipes_controller.rb

  def show
    @meal = @meal_recipe.meal
    @meal_plan = @meal.day.meal_plan
    @leftover = Leftover.meal_recipe(@meal_recipe).first
---
SELECT "leftovers".* FROM "leftovers" WHERE "leftovers"."meal_recipe_id" = $1 ORDER BY "leftovers"."id" ASC LIMIT $2  [["meal_recipe_id", 121], ["LIMIT", 1]]

  def create
    @meal_recipe = MealRecipe.new(meal_recipe_params)

    @meal_plan = @meal_recipe.meal.day.meal_plan
    @meal = @meal_recipe.meal
    # @day = @meal.day
    @meal_ingredient = MealIngredient.new
    # @leftover = Leftover.user(current_user).includes(:meal_recipe)

    if @meal_recipe.recipe.present?
      @meal_recipe.portions = @meal_recipe.recipe.portions
    end

    respond_to do |format|

      if @meal_recipe.recipe.present? && @meal_recipe.save
---
SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."meal_id" = $1  [["meal_id", 739]]
INSERT INTO "meal_recipes" ("meal_id", "recipe_id", "created_at", "updated_at", "portions") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["meal_id", 739], ["recipe_id", 2], ["created_at", "2021-10-27 10:01:29.365251"], ["updated_at", "2021-10-27 10:01:29.365251"], ["portions", "2.0"]]

  def update
    @meal = @meal_recipe.meal
    @meal_plan = @meal.day.meal_plan
    @leftover = Leftover.meal_recipe(@meal_recipe).first
    @meal_ingredient = MealIngredient.new

    respond_to do |format|
      if params[:meal_recipe][:multiply].present?
        multiply_portions_and_ingredients(params[:meal_recipe][:multiply].to_d)
      end

      if params[:meal_recipe][:add].present?
        # @meal_recipe = MealRecipe.find(params[:id])
        @portions = @meal_recipe.portions
        ratio_increase = 1 + 1/@portions
        multiply_portions_and_ingredients(ratio_increase)
      end


      if @meal_recipe.update(meal_recipe_params)
---
SELECT "leftovers".* FROM "leftovers" WHERE "leftovers"."meal_recipe_id" = $1 ORDER BY "leftovers"."id" ASC LIMIT $2  [["meal_recipe_id", 130], ["LIMIT", 1]]
UPDATE "meal_recipes" SET "portions" = $1, "updated_at" = $2 WHERE "meal_recipes"."id" = $3  [["portions", "12.0"], ["updated_at", "2021-10-27 10:04:31.960098"], ["id", 130]]

  def destroy

    @meal = @meal_recipe.meal

    @meal_ingredient = MealIngredient.new
    @meal_plan = @meal_recipe.meal.day.meal_plan
    @meal_recipe.destroy
---
DELETE FROM "meal_recipes" WHERE "meal_recipes"."id" = $1  [["id", 125]]

    def set_meal_recipe
      @meal_recipe = MealRecipe.find(params[:id])
---
SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."id" = $1 LIMIT $2  [["id", 121], ["LIMIT", 1]]

    def create_meal_ingredients_for_recipe(meal_recipe)
      recipe = meal_recipe.recipe
      meal = meal_recipe.meal
      meal_plan = meal.day.meal_plan
      # if @recipe.present?
        recipe.recipe_ingredients.each do |recipe_ingredient|
            @meal_ingredient = MealIngredient.new
            @meal_ingredient.ingredient = recipe_ingredient.ingredient
            @meal_ingredient.quantity = recipe_ingredient.quantity
            @meal_ingredient.unit = recipe_ingredient.unit
            @meal_ingredient.preparation = recipe_ingredient.preparation
            @meal_ingredient.meal_recipe_id = meal_recipe.id
            @meal_ingredient.meal = meal
            @meal_ingredient.recipe_ingredient_id = recipe_ingredient.id
            @meal_ingredient.meal_plan_id = meal_plan.id

            if @meal_ingredient.save
---
SELECT "ingredients".* FROM "ingredients" ORDER BY name ASC
INSERT INTO "meal_ingredients" ("meal_id", "ingredient_id", "quantity", "unit", "created_at", "updated_at", "meal_recipe_id", "preparation", "recipe_ingredient_id", "meal_plan_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

    def multiply_portions_and_ingredients(multiply_by)
      @meal_recipe = MealRecipe.find(params[:id])
      @meal_plan = @meal_recipe.meal.day.meal_plan
      meal_ingredients = @meal_recipe.meal_ingredients
      @meal_recipe.portions *= multiply_by

      if @meal_recipe.save
          meal_ingredients.each do |meal_ingredient|
            meal_ingredient.quantity *= multiply_by
            meal_ingredient.save
---
SELECT "meal_recipes".* FROM "meal_recipes" WHERE "meal_recipes"."id" = $1 LIMIT $2  [["id", 130], ["LIMIT", 1]]
UPDATE "meal_recipes" SET "portions" = $1, "updated_at" = $2 WHERE "meal_recipes"."id" = $3  [["portions", "12.0"], ["updated_at", "2021-10-27 10:04:31.960098"], ["id", 130]]
SELECT "meal_ingredients".* FROM "meal_ingredients" WHERE "meal_ingredients"."meal_recipe_id" = $1  [["meal_recipe_id", 130]]
UPDATE "meal_ingredients" SET "quantity" = $1, "updated_at" = $2 WHERE "meal_ingredients"."id" = $3  [["quantity", "6.0"], ["updated_at", "2021-10-27 10:04:31.969246"], ["id", 907]]