app/controllers/meals_controller.rb

  def destroy
    @meal_plan = @meal.day.meal_plan
    @meal.destroy
---
DELETE FROM "meals" WHERE "meals"."id" = $1  [["id", 738]]