app/models/leftover.rb

  def calculated_stock_level
    self.max_portions - self.meal_with_leftovers.sum(:portions)
---
SELECT "meal_with_leftovers".* FROM "meal_with_leftovers" WHERE "meal_with_leftovers"."meal_id" = $1  [["meal_id", 738]]
SELECT SUM("meal_with_leftovers"."portions") FROM "meal_with_leftovers" WHERE "meal_with_leftovers"."leftover_id" = $1  [["leftover_id", 102]]