app/models/meal_plan.rb

  def start_date
    if self.days.present?
      self.days.order(:date).first.date
---
SELECT "days".* FROM "days" WHERE "days"."meal_plan_id" = $1 ORDER BY date ASC  [["meal_plan_id", 24]]
SELECT "days".* FROM "days" WHERE "days"."meal_plan_id" = $1 ORDER BY date ASC, "days"."date" ASC LIMIT $2  [["meal_plan_id", 24], ["LIMIT", 1]]

  def number_of_days
    if self.days.present?
      self.days.count
---
SELECT COUNT(*) FROM "days" WHERE "days"."meal_plan_id" = $1  [["meal_plan_id", 24]]

  def status
    if self.shopping_list_items.present?
---
SELECT "shopping_list_items".* FROM "shopping_list_items" WHERE "shopping_list_items"."meal_plan_id" = $1  [["meal_plan_id", 24]]

  def meal_ingredient_array
    MealIngredient.meal_plan(self).group(:ingredient_id, :unit).sum(:quantity).to_a
---
SELECT "ingredients".* FROM "ingredients" ORDER BY name ASC