app/models/meal_recipe.rb

SELECT "leftovers".* FROM "leftovers" WHERE "leftovers"."meal_recipe_id" = $1 LIMIT $2  [["meal_recipe_id", 130], ["LIMIT", 1]]
---
  def make_more_than_you_save
    if self.leftover.present?
      unless self.portions - self.leftover.sum(:max_portions) >= 0